trade_exp/src/DataProcessors/ЖурналДокументовПродажи/ЖурналДокументовПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9442c42a-1265-415a-8691-6835a1a67c8b">
  <name>ЖурналДокументовПродажи</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="44851db7-ace4-11e7-7088-f45c898df8f7">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="448617a8-ace4-11e7-7088-f45c898df8f7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862216-ace4-11e7-7088-f45c898df8f7">
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44862720-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4485debe-ace4-11e7-7088-f45c898df8f7">
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862c2a-ace4-11e7-7088-f45c898df8f7">
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861d0c-ace4-11e7-7088-f45c898df8f7">
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863652-ace4-11e7-7088-f45c898df8f7">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="448607f4-ace4-11e7-7088-f45c898df8f7">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863134-ace4-11e7-7088-f45c898df8f7">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861276-ace4-11e7-7088-f45c898df8f7">
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860d4e-ace4-11e7-7088-f45c898df8f7">
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c033ddc4-ace7-11e7-7088-f45c898df8f7">
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="831ffe7e-f3df-4095-a10b-b5fb3a077003">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="9db0faa0-6639-4188-b1ae-45947ea159fa">
    <name>СторноИсправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f67589b3-bd43-48f7-a0f9-db01f3da814e">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="448640c0-ace4-11e7-7088-f45c898df8f7">
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44864796-ace4-11e7-7088-f45c898df8f7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44867356-ace4-11e7-7088-f45c898df8f7">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44866bd6-ace4-11e7-7088-f45c898df8f7">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448698e0-ace4-11e7-7088-f45c898df8f7">
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448679be-ace4-11e7-7088-f45c898df8f7">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448692aa-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868666-ace4-11e7-7088-f45c898df8f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868c92-ace4-11e7-7088-f45c898df8f7">
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СостоянияПоОбъектамУчетаЭДО/СостоянияПоОбъектамУчетаЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="94cb8fd8-e78e-4367-870e-e56a7e5e245d">
  <name>СостоянияПоОбъектамУчетаЭДО</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="9eb44008-3db8-4c27-940d-149dfe89ffe0">
    <name>СостояниеЭДО</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="cb90bdf4-c492-45ef-b596-12109e8f7847">
    <name>ПредставлениеСостояния</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="bb074754-23ca-4d93-98f1-533aec10d349">
    <name>СсылкаНаОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДокументыСОшибкамиПроверкиКонтрагентов/ДокументыСОшибкамиПроверкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДокументыСОшибкамиПроверкиКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/DataProcessors/ЖурналДокументовПродажи/Forms/СписокДокументов/Module.bsl
&НаКлиенте
Процедура Док_УстановитьСтатусВыгруженоПосле(Команда)	
	УстановитьСтатус("Выгружен");
КонецПроцедуры    

&НаКлиенте
Процедура Док_УстановитьСтатусПодписаноПосле(Команда)
	УстановитьСтатус("Подписан");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Статус)	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.СписокДокументыПродажи);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;    
	
	Для Каждого  ДокументСтр Из ВыделенныеСтроки Цикл
		УстановитьСтатусНаДокумент(ДокументСтр, Статус);
	Конеццикла;

	Элементы.СписокДокументыПродажи.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусНаДокумент(ДокументСтр,Статус)
	
	ДокументОбъект=ДокументСтр.Ссылка.ПолучитьОбъект();
	МетаданныеОбъекта=ДокументОбъект.Метаданные();
	Если Общегоназначения.ЕстьРеквизитОбъекта("СтатусДокументаВЭДО",МетаданныеОбъекта) И ДокументОбъект.СтатусДокументаВЭДО<>перечисления.СтатусыДокументаЭДО[Статус] Тогда
		ДокументОбъект.СтатусДокументаВЭДО = Перечисления.СтатусыДокументаЭДО[Статус];
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ДопМодуль.ОбработатьЛистСогласованияПоДокументу(Статус, ДокументСтр.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

#Область ПоискПоQR

&НаСервере
Функция ПолучитьДокументПродажи(ДокументОплаты)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа КАК ОснованиеПлатежа
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
		|ГДЕ
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументОплаты);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ОснованиеПлатежа;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Док__ДокументПродажиОчисткаПосле(Элемент, СтандартнаяОбработка)
	Элементы._ДокументПродажи.Видимость = Ложь;
	ОчисткаПосле();
КонецПроцедуры         

&НаКлиенте
Процедура ОчиститьПоискQR()
	Элементы.СписокДокументыПродажи_ОчиститьПоискПоQR.Видимость = Ложь;
	ОчисткаПосле();
КонецПроцедуры  

&НаКлиенте
Процедура Док__ОтменитьПоискПоQRПосле(Команда)
	ОчиститьПоискQR();
КонецПроцедуры
	
&НаКлиенте
Процедура ОчисткаПосле()
	_ОтборДокумент.Очистить();
	УстановитьЭлементОтбораДинамическогоСписка();
КонецПроцедуры 
	
Процедура УстановитьЭлементОтбораДинамическогоСписка()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДокументыПродажи,
		"Ссылка",
		_ОтборДокумент,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		ЗначениеЗаполнено(_ОтборДокумент));
КонецПроцедуры

&НаКлиенте
Процедура Док_ОбработкаОповещенияПеред(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр.Количество() > 0 И ТипЗнч(Параметр[0])=Тип("Строка") Тогда
				СтрокаКода = Параметр[0];
				Если СтрНайти(НРег(СтрокаКода), "fn") <> 0 Тогда
					СФП_МаркерыКлиент.МаркерНачало("Журнал документов продажи сканирование");
					
					ОчиститьСообщения();
					СсылкаНаДокумент = АльтерраОбщегоНазначения.ПолучитьСсылкуНаДокументПоQR(СтрокаКода);
					СсылкаНаПродажу = ПолучитьДокументПродажи(СсылкаНаДокумент);
					Если СсылкаНаПродажу<>Неопределено ИЛИ ТипЗнч(СсылкаНаПродажу)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
						Элементы.СписокДокументыПродажи_ОчиститьПоискПоQR.Видимость = Истина;
						_ДокументПродажи = СсылкаНаПродажу;
						_ОтборДокумент.Добавить(_ДокументПродажи);
						УстановитьЭлементОтбораДинамическогоСписка();
						МенеджерОборудованияУТКлиент.ОбработатьСобытие();
					Иначе
						ОчиститьПоискQR();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&Вместо("ТекстЗапросаСписокДокументыПродажи")
Функция Док_ТекстЗапросаСписокДокументыПродажи()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РеестрДокументов.Ссылка КАК Ссылка,  
	|	РеестрДокументов.Ссылка.Кассир КАК Кассир,
	|	РеестрДокументов.НомерДокументаИБ КАК Номер,
	|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументов.Статус КАК Статус,
	|	РеестрДокументов.Проведен КАК Проведен,
	|	РеестрДокументов.ПометкаУдаления КАК ПометкаУдаления,
	|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеестрДокументов.Партнер КАК Партнер,
	|	ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Контрагенты) КАК Контрагент,
	|	РеестрДокументов.Контрагент КАК КонтрагентКлюч,
	|	РеестрДокументов.Договор КАК Договор,
	|	РеестрДокументов.Организация КАК Организация,
	|	РеестрДокументов.Подразделение КАК Подразделение,
	|	РеестрДокументов.МестоХранения КАК МестоХранения,
	|	ВЫРАЗИТЬ(РеестрДокументов.МестоХранения.Ключ КАК Справочник.Склады) КАК Склад,
	|	РеестрДокументов.Валюта КАК Валюта,
	|	РеестрДокументов.Сумма КАК СуммаДокумента,
	|	РеестрДокументов.Ответственный КАК Менеджер,
	|	РеестрДокументов.Автор КАК Автор,
	|	РеестрДокументов.Комментарий КАК Комментарий,
	|	РеестрДокументов.НомерПервичногоДокумента КАК НомерВходящегоДокумента,
	|	РеестрДокументов.ДатаПервичногоДокумента КАК ДатаВходящегоДокумента,
	|	РеестрДокументов.Дополнительно КАК Дополнительно,
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|	СостоянияЭД.СостояниеЭДО КАК СостояниеВерсииЭД,
	|	СостоянияЭД.ПредставлениеСостояния КАК ПредставлениеСостояния,
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|	ВЫБОР
	|		КОГДА ДокументыСОшибкамиПроверкиКонтрагентов.Документ ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиПроверкиКонтрагентов,
	|	ВЫБОР
	|		КОГДА РеестрДокументов.Проведен
	|			ТОГДА 0
	|		КОГДА РеестрДокументов.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК НестандартнаяКартинка,
	|	РеестрДокументов.ДополнительнаяЗапись КАК ДополнительнаяЗапись,
	|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
	|	&СтатусПроверки КАК СтатусПроверки,
	|	&ИндикаторПроверки КАК ИндикаторПроверки,
	|	ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) КАК ТипЗначения,
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	|	NULL КАК СостояниеОригиналаПервичногоДокумента,
	|	ИСТИНА КАК ОбщееСостояние,
	|	0 КАК СостояниеОригиналПолучен,
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	|	РеестрДокументов.СторноИсправление КАК СторноИсправление,
	|	ВЫБОР 
	|		КОГДА НЕ РеестрДокументов.СторноИсправление
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеестрДокументов.СторнируемыйДокумент
	|	КОНЕЦ КАК СторнируемыйИсправляемыйДокумент,
	|	ВЫРАЗИТЬ("""" КАК Строка(50)) КАК СостояниеГИСМТ
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		{
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
	|		ПО (СостоянияЭД.СсылкаНаОбъект = РеестрДокументов.Ссылка)
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыСОшибкамиПроверкиКонтрагентов КАК ДокументыСОшибкамиПроверкиКонтрагентов
	|		ПО РеестрДокументов.Ссылка = ДокументыСОшибкамиПроверкиКонтрагентов.Документ
	|			И (&ИспользованиеПроверкиВозможно)}
	|{ГДЕ
	|	РеестрДокументов.Ссылка.* КАК Ссылка,
	|	РеестрДокументов.МестоХранения.* КАК МестоХранения,
	|	(ВЫРАЗИТЬ(РеестрДокументов.МестоХранения.Ключ КАК Справочник.Склады)).* КАК Склад,
	|	РеестрДокументов.Организация.* КАК Организация,
	|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументов.НомерДокументаИБ КАК Номер,
	|	РеестрДокументов.Статус КАК Статус,
	|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
	|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеестрДокументов.Партнер.* КАК Партнер,
	|	(ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Контрагенты)).* КАК Контрагент,
	|	РеестрДокументов.Договор.* КАК Договор,
	|	РеестрДокументов.Подразделение.* КАК Подразделение,
	|	РеестрДокументов.Ответственный.* КАК Менеджер,
	|	РеестрДокументов.Автор.* КАК Автор,
	|	РеестрДокументов.Дополнительно КАК Дополнительно,
	|	РеестрДокументов.Комментарий КАК Комментарий,
	|	РеестрДокументов.Проведен КАК Проведен,
	|	РеестрДокументов.ПометкаУдаления КАК ПометкаУдаления,
	|	((РеестрДокументов.ДатаДокументаИБ >= &НачалоПериода
	|			ИЛИ &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
	|			И (РеестрДокументов.ДатаДокументаИБ <= &КонецПериода
	|				ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1)))}";

	Возврат ТекстЗапроса;

КонецФункции

&НаКлиенте
Процедура Док_СписокДокументыПродажиПриАктивизацииСтрокиПосле(Элемент)
	
 ТекДанные = Элементы.СписокДокументыПродажи.ТекущиеДанные;
	 
 Если ТекДанные <> Неопределено Тогда
	 ТекущийДокумент = ТекДанные.Ссылка; 
 КонецЕсли;
 
КонецПроцедуры

#КонецОбласти
